# ####################################################################

#  Created by Genus(TM) Synthesis Solution 18.14-s037_1 on Tue Apr 22 12:09:00 EDT 2025

# ####################################################################

set sdc_version 2.0

set_units -capacitance 1.0fF
set_units -time 1000.0ps

# Set the current design
current_design RightShift_16_flopped

create_clock -name "ideal_clock" -period 10.0 -waveform {0.0 5.0} [get_ports clk]
set_load -pin_load 7.0 [get_ports {sum_flopped[15]}]
set_load -pin_load 7.0 [get_ports {sum_flopped[14]}]
set_load -pin_load 7.0 [get_ports {sum_flopped[13]}]
set_load -pin_load 7.0 [get_ports {sum_flopped[12]}]
set_load -pin_load 7.0 [get_ports {sum_flopped[11]}]
set_load -pin_load 7.0 [get_ports {sum_flopped[10]}]
set_load -pin_load 7.0 [get_ports {sum_flopped[9]}]
set_load -pin_load 7.0 [get_ports {sum_flopped[8]}]
set_load -pin_load 7.0 [get_ports {sum_flopped[7]}]
set_load -pin_load 7.0 [get_ports {sum_flopped[6]}]
set_load -pin_load 7.0 [get_ports {sum_flopped[5]}]
set_load -pin_load 7.0 [get_ports {sum_flopped[4]}]
set_load -pin_load 7.0 [get_ports {sum_flopped[3]}]
set_load -pin_load 7.0 [get_ports {sum_flopped[2]}]
set_load -pin_load 7.0 [get_ports {sum_flopped[1]}]
set_load -pin_load 7.0 [get_ports {sum_flopped[0]}]
set_clock_gating_check -setup 0.0 
set_input_delay -clock [get_clocks ideal_clock] -add_delay 0.0 [get_ports {a[15]}]
set_input_delay -clock [get_clocks ideal_clock] -add_delay 0.0 [get_ports {a[14]}]
set_input_delay -clock [get_clocks ideal_clock] -add_delay 0.0 [get_ports {a[13]}]
set_input_delay -clock [get_clocks ideal_clock] -add_delay 0.0 [get_ports {a[12]}]
set_input_delay -clock [get_clocks ideal_clock] -add_delay 0.0 [get_ports {a[11]}]
set_input_delay -clock [get_clocks ideal_clock] -add_delay 0.0 [get_ports {a[10]}]
set_input_delay -clock [get_clocks ideal_clock] -add_delay 0.0 [get_ports {a[9]}]
set_input_delay -clock [get_clocks ideal_clock] -add_delay 0.0 [get_ports {a[8]}]
set_input_delay -clock [get_clocks ideal_clock] -add_delay 0.0 [get_ports {a[7]}]
set_input_delay -clock [get_clocks ideal_clock] -add_delay 0.0 [get_ports {a[6]}]
set_input_delay -clock [get_clocks ideal_clock] -add_delay 0.0 [get_ports {a[5]}]
set_input_delay -clock [get_clocks ideal_clock] -add_delay 0.0 [get_ports {a[4]}]
set_input_delay -clock [get_clocks ideal_clock] -add_delay 0.0 [get_ports {a[3]}]
set_input_delay -clock [get_clocks ideal_clock] -add_delay 0.0 [get_ports {a[2]}]
set_input_delay -clock [get_clocks ideal_clock] -add_delay 0.0 [get_ports {a[1]}]
set_input_delay -clock [get_clocks ideal_clock] -add_delay 0.0 [get_ports {a[0]}]
set_input_delay -clock [get_clocks ideal_clock] -add_delay 0.0 [get_ports {b[15]}]
set_input_delay -clock [get_clocks ideal_clock] -add_delay 0.0 [get_ports {b[14]}]
set_input_delay -clock [get_clocks ideal_clock] -add_delay 0.0 [get_ports {b[13]}]
set_input_delay -clock [get_clocks ideal_clock] -add_delay 0.0 [get_ports {b[12]}]
set_input_delay -clock [get_clocks ideal_clock] -add_delay 0.0 [get_ports {b[11]}]
set_input_delay -clock [get_clocks ideal_clock] -add_delay 0.0 [get_ports {b[10]}]
set_input_delay -clock [get_clocks ideal_clock] -add_delay 0.0 [get_ports {b[9]}]
set_input_delay -clock [get_clocks ideal_clock] -add_delay 0.0 [get_ports {b[8]}]
set_input_delay -clock [get_clocks ideal_clock] -add_delay 0.0 [get_ports {b[7]}]
set_input_delay -clock [get_clocks ideal_clock] -add_delay 0.0 [get_ports {b[6]}]
set_input_delay -clock [get_clocks ideal_clock] -add_delay 0.0 [get_ports {b[5]}]
set_input_delay -clock [get_clocks ideal_clock] -add_delay 0.0 [get_ports {b[4]}]
set_input_delay -clock [get_clocks ideal_clock] -add_delay 0.0 [get_ports {b[3]}]
set_input_delay -clock [get_clocks ideal_clock] -add_delay 0.0 [get_ports {b[2]}]
set_input_delay -clock [get_clocks ideal_clock] -add_delay 0.0 [get_ports {b[1]}]
set_input_delay -clock [get_clocks ideal_clock] -add_delay 0.0 [get_ports {b[0]}]
set_input_delay -clock [get_clocks ideal_clock] -add_delay 0.0 [get_ports clk]
set_output_delay -clock [get_clocks ideal_clock] -add_delay 0.0 [get_ports {sum_flopped[15]}]
set_output_delay -clock [get_clocks ideal_clock] -add_delay 0.0 [get_ports {sum_flopped[14]}]
set_output_delay -clock [get_clocks ideal_clock] -add_delay 0.0 [get_ports {sum_flopped[13]}]
set_output_delay -clock [get_clocks ideal_clock] -add_delay 0.0 [get_ports {sum_flopped[12]}]
set_output_delay -clock [get_clocks ideal_clock] -add_delay 0.0 [get_ports {sum_flopped[11]}]
set_output_delay -clock [get_clocks ideal_clock] -add_delay 0.0 [get_ports {sum_flopped[10]}]
set_output_delay -clock [get_clocks ideal_clock] -add_delay 0.0 [get_ports {sum_flopped[9]}]
set_output_delay -clock [get_clocks ideal_clock] -add_delay 0.0 [get_ports {sum_flopped[8]}]
set_output_delay -clock [get_clocks ideal_clock] -add_delay 0.0 [get_ports {sum_flopped[7]}]
set_output_delay -clock [get_clocks ideal_clock] -add_delay 0.0 [get_ports {sum_flopped[6]}]
set_output_delay -clock [get_clocks ideal_clock] -add_delay 0.0 [get_ports {sum_flopped[5]}]
set_output_delay -clock [get_clocks ideal_clock] -add_delay 0.0 [get_ports {sum_flopped[4]}]
set_output_delay -clock [get_clocks ideal_clock] -add_delay 0.0 [get_ports {sum_flopped[3]}]
set_output_delay -clock [get_clocks ideal_clock] -add_delay 0.0 [get_ports {sum_flopped[2]}]
set_output_delay -clock [get_clocks ideal_clock] -add_delay 0.0 [get_ports {sum_flopped[1]}]
set_output_delay -clock [get_clocks ideal_clock] -add_delay 0.0 [get_ports {sum_flopped[0]}]
set_max_fanout 20.000 [current_design]
set_max_transition 2.5 [current_design]
set_driving_cell -no_design_rule -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {a[15]}]
set_driving_cell -no_design_rule -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {a[14]}]
set_driving_cell -no_design_rule -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {a[13]}]
set_driving_cell -no_design_rule -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {a[12]}]
set_driving_cell -no_design_rule -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {a[11]}]
set_driving_cell -no_design_rule -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {a[10]}]
set_driving_cell -no_design_rule -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {a[9]}]
set_driving_cell -no_design_rule -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {a[8]}]
set_driving_cell -no_design_rule -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {a[7]}]
set_driving_cell -no_design_rule -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {a[6]}]
set_driving_cell -no_design_rule -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {a[5]}]
set_driving_cell -no_design_rule -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {a[4]}]
set_driving_cell -no_design_rule -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {a[3]}]
set_driving_cell -no_design_rule -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {a[2]}]
set_driving_cell -no_design_rule -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {a[1]}]
set_driving_cell -no_design_rule -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {a[0]}]
set_driving_cell -no_design_rule -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {b[15]}]
set_driving_cell -no_design_rule -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {b[14]}]
set_driving_cell -no_design_rule -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {b[13]}]
set_driving_cell -no_design_rule -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {b[12]}]
set_driving_cell -no_design_rule -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {b[11]}]
set_driving_cell -no_design_rule -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {b[10]}]
set_driving_cell -no_design_rule -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {b[9]}]
set_driving_cell -no_design_rule -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {b[8]}]
set_driving_cell -no_design_rule -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {b[7]}]
set_driving_cell -no_design_rule -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {b[6]}]
set_driving_cell -no_design_rule -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {b[5]}]
set_driving_cell -no_design_rule -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {b[4]}]
set_driving_cell -no_design_rule -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {b[3]}]
set_driving_cell -no_design_rule -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {b[2]}]
set_driving_cell -no_design_rule -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {b[1]}]
set_driving_cell -no_design_rule -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {b[0]}]
set_driving_cell -no_design_rule -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports clk]
set_dont_use [get_lib_cells NangateOpenCellLibrary/ANTENNA_X1]
set_dont_use [get_lib_cells NangateOpenCellLibrary/WELLTAP_X1]
set_dont_use [get_lib_cells NangateOpenCellLibrary/FILLCELL_X1]
set_dont_use [get_lib_cells NangateOpenCellLibrary/FILLCELL_X2]
set_dont_use [get_lib_cells NangateOpenCellLibrary/FILLCELL_X4]
set_dont_use [get_lib_cells NangateOpenCellLibrary/FILLCELL_X8]
set_dont_use [get_lib_cells NangateOpenCellLibrary/FILLCELL_X16]
set_dont_use [get_lib_cells NangateOpenCellLibrary/FILLCELL_X32]
set_dont_use [get_lib_cells NangateOpenCellLibrary/LOGIC0_X1]
set_dont_use [get_lib_cells NangateOpenCellLibrary/LOGIC1_X1]
